<B>##DATAFRAMES

In [1]:
import pandas as pd

In [2]:
d1=[100,200,300,400,500]
d2=[501,502,503,504,505]
d3=['pune','mumbai','nashik','delhi','banglore']
d4={'A':11,'B':12,'C':13,'D':14,'E':15}

In [3]:
pd.Series(d1)

0    100
1    200
2    300
3    400
4    500
dtype: int64

In [10]:
type(pd.Series(d1))

pandas.core.series.Series

In [11]:
pd.Series(data=d3,index=d1)

100        pune
200      mumbai
300      nashik
400       delhi
500    banglore
dtype: object

In [12]:
pd.Series(d3,d1)

100        pune
200      mumbai
300      nashik
400       delhi
500    banglore
dtype: object

In [13]:
pd.Series(d1,d3)

pune        100
mumbai      200
nashik      300
delhi       400
banglore    500
dtype: int64

In [16]:
pd.Series(d3,d2)

501        pune
502      mumbai
503      nashik
504       delhi
505    banglore
dtype: object

In [14]:
d4

{'A': 11, 'B': 12, 'C': 13, 'D': 14, 'E': 15}

In [15]:
pd.Series(d4)

A    11
B    12
C    13
D    14
E    15
dtype: int64

In [4]:
pd.Series(d3,d4)

A        pune
B      mumbai
C      nashik
D       delhi
E    banglore
dtype: object

In [5]:
pd.Series(d4,d3)

pune       NaN
mumbai     NaN
nashik     NaN
delhi      NaN
banglore   NaN
dtype: float64

In [50]:
s1=pd.Series([10,20,30,40,50],['pune','mumbai','nashik','delhi','banglore'])

In [51]:
s2=pd.Series([10,20,30,40,50],['pune','mumbai','nashik','hyderabad','banglore'])

In [52]:
s1

pune        10
mumbai      20
nashik      30
delhi       40
banglore    50
dtype: int64

In [53]:
s2

pune         10
mumbai       20
nashik       30
hyderabad    40
banglore     50
dtype: int64

In [54]:
s1+s2

banglore     100.0
delhi          NaN
hyderabad      NaN
mumbai        40.0
nashik        60.0
pune          20.0
dtype: float64

In [37]:
#Dataframes
import numpy as np

In [38]:
np.random.randn(5,4)

array([[-1.25935403, -1.52665178, -0.43329769, -0.76599944],
       [-0.37360762, -0.6668204 , -0.48168607,  0.94057282],
       [-0.65320725,  0.40848198,  0.11849739,  0.46074316],
       [ 1.25732617, -0.30368987, -0.69412497, -1.44773938],
       [-0.1856279 , -0.95897331,  0.60345543, -1.31108988]])

In [39]:
data=pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [40]:
data

          W         X         Y         Z
A -0.953661  0.297123  0.400042  0.142764
B -0.153135  0.788925 -0.057703 -1.768406
C -0.853867 -0.757030 -0.658223 -0.713466
D  1.809611 -0.919385 -1.012534  0.892330
E  1.157111 -1.307286  0.304047  1.125050

In [41]:
data.loc['B']

W   -0.153135
X    0.788925
Y   -0.057703
Z   -1.768406
Name: B, dtype: float64

In [42]:
data[['W','X','Z']]

          W         X         Z
A -0.953661  0.297123  0.142764
B -0.153135  0.788925 -1.768406
C -0.853867 -0.757030 -0.713466
D  1.809611 -0.919385  0.892330
E  1.157111 -1.307286  1.125050

In [43]:
type(data)

pandas.core.frame.DataFrame

In [44]:
data.shape

(5, 4)

In [45]:
data['W']

A   -0.953661
B   -0.153135
C   -0.853867
D    1.809611
E    1.157111
Name: W, dtype: float64

In [46]:
type(data[['W','Y']])

pandas.core.frame.DataFrame

In [47]:
data[['W','Y','Z']]

          W         Y         Z
A -0.953661  0.400042  0.142764
B -0.153135 -0.057703 -1.768406
C -0.853867 -0.658223 -0.713466
D  1.809611 -1.012534  0.892330
E  1.157111  0.304047  1.125050

In [48]:
data.loc['B']

W   -0.153135
X    0.788925
Y   -0.057703
Z   -1.768406
Name: B, dtype: float64

In [49]:
type(data.loc['B'])

pandas.core.series.Series

In [50]:
data.loc['B','Y']

-0.05770252817932122

In [51]:
data.iloc[1]

W   -0.153135
X    0.788925
Y   -0.057703
Z   -1.768406
Name: B, dtype: float64

In [52]:
data['W']>0

A    False
B    False
C    False
D     True
E     True
Name: W, dtype: bool

In [53]:
data[data['W']>0]

          W         X         Y        Z
D  1.809611 -0.919385 -1.012534  0.89233
E  1.157111 -1.307286  0.304047  1.12505

In [58]:
data

          W         X         Y         Z
A -0.953661  0.297123  0.400042  0.142764
B -0.153135  0.788925 -0.057703 -1.768406
C -0.853867 -0.757030 -0.658223 -0.713466
D  1.809611 -0.919385 -1.012534  0.892330
E  1.157111 -1.307286  0.304047  1.125050

In [59]:
data[data['W']>0]['Z']

D    0.89233
E    1.12505
Name: Z, dtype: float64

In [60]:
data.loc[data['W']>0,['Z']]

         Z
D  0.89233
E  1.12505

In [61]:
data.loc[(data['W']>1)&(data['X']<0),'Y']

D   -1.012534
E    0.304047
Name: Y, dtype: float64

In [62]:
data

          W         X         Y         Z
A -0.953661  0.297123  0.400042  0.142764
B -0.153135  0.788925 -0.057703 -1.768406
C -0.853867 -0.757030 -0.658223 -0.713466
D  1.809611 -0.919385 -1.012534  0.892330
E  1.157111 -1.307286  0.304047  1.125050

In [66]:
data['new_column']=data['W']+data['X']

In [67]:
data

          W         X         Y         Z  new_column
A -0.953661  0.297123  0.400042  0.142764   -0.656538
B -0.153135  0.788925 -0.057703 -1.768406    0.635790
C -0.853867 -0.757030 -0.658223 -0.713466   -1.610897
D  1.809611 -0.919385 -1.012534  0.892330    0.890226
E  1.157111 -1.307286  0.304047  1.125050   -0.150175

In [70]:
data.drop('new_column',axis=1)

          W         X         Y         Z
A -0.953661  0.297123  0.400042  0.142764
B -0.153135  0.788925 -0.057703 -1.768406
C -0.853867 -0.757030 -0.658223 -0.713466
D  1.809611 -0.919385 -1.012534  0.892330
E  1.157111 -1.307286  0.304047  1.125050

In [71]:
data

          W         X         Y         Z  new_column
A -0.953661  0.297123  0.400042  0.142764   -0.656538
B -0.153135  0.788925 -0.057703 -1.768406    0.635790
C -0.853867 -0.757030 -0.658223 -0.713466   -1.610897
D  1.809611 -0.919385 -1.012534  0.892330    0.890226
E  1.157111 -1.307286  0.304047  1.125050   -0.150175

In [72]:
data.drop("new_column",axis=1,inplace=True)

In [73]:
data

          W         X         Y         Z
A -0.953661  0.297123  0.400042  0.142764
B -0.153135  0.788925 -0.057703 -1.768406
C -0.853867 -0.757030 -0.658223 -0.713466
D  1.809611 -0.919385 -1.012534  0.892330
E  1.157111 -1.307286  0.304047  1.125050

In [74]:
d3

['pune', 'mumbai', 'nashik', 'delhi', 'banglore']

In [75]:
data.index=d3

In [76]:
data

                 W         X         Y         Z
pune     -0.953661  0.297123  0.400042  0.142764
mumbai   -0.153135  0.788925 -0.057703 -1.768406
nashik   -0.853867 -0.757030 -0.658223 -0.713466
delhi     1.809611 -0.919385 -1.012534  0.892330
banglore  1.157111 -1.307286  0.304047  1.125050

In [81]:
data.reset_index()

      index         W         X         Y         Z
0      pune -0.953661  0.297123  0.400042  0.142764
1    mumbai -0.153135  0.788925 -0.057703 -1.768406
2    nashik -0.853867 -0.757030 -0.658223 -0.713466
3     delhi  1.809611 -0.919385 -1.012534  0.892330
4  banglore  1.157111 -1.307286  0.304047  1.125050

In [82]:
data

                 W         X         Y         Z
pune     -0.953661  0.297123  0.400042  0.142764
mumbai   -0.153135  0.788925 -0.057703 -1.768406
nashik   -0.853867 -0.757030 -0.658223 -0.713466
delhi     1.809611 -0.919385 -1.012534  0.892330
banglore  1.157111 -1.307286  0.304047  1.125050

In [83]:
data.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [84]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, pune to banglore
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [73]:
##Multi-Index and Hierarchy

In [85]:
#Index levels
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
h1=list(zip(outside,inside))
h1

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [87]:
hier_index=pd.MultiIndex.from_tuples(h1)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [88]:
df=pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [89]:
df

             A         B
G1 1  0.051163 -0.561290
   2  0.129462  0.271689
   3  0.249661 -1.506746
G2 1  0.422015 -0.796369
   2  0.971493  0.001201
   3  0.777321 -0.760979

In [91]:
type(df)

pandas.core.frame.DataFrame

In [92]:
df.loc['G1']

          A         B
1  0.051163 -0.561290
2  0.129462  0.271689
3  0.249661 -1.506746

In [97]:
df.loc['G1'].loc[1]

A    0.051163
B   -0.561290
Name: 1, dtype: float64

In [98]:
df.index.names

FrozenList([None, None])

In [99]:
df.index.names=['Group','Num']

In [91]:
df

                  A         B
Group Num
G1    1   -1.278869 -1.268451
      2   -1.494998 -0.960871
      3    0.684857 -0.236077
G2    1    0.365480  1.123089
      2   -0.875759  1.105653
      3   -0.928465  0.330828

In [100]:
df.xs('G1')   #cross section

            A         B
Num
1    0.051163 -0.561290
2    0.129462  0.271689
3    0.249661 -1.506746

In [93]:
df.xs(('G1',1))

A   -1.278869
B   -1.268451
Name: (G1, 1), dtype: float64

In [94]:
df.xs(('G1',2))

A   -1.494998
B   -0.960871
Name: (G1, 2), dtype: float64

In [95]:
df.xs(1,level='Num')

              A         B
Group
G1    -1.278869 -1.268451
G2     0.365480  1.123089

<b>#Missing Data

In [101]:
import numpy as np
import pandas as pd

In [102]:
d={'A':[1,2,np.nan],
   'B':[5,np.nan,np.nan],
   'C':[1,2,3]}

In [103]:
df=pd.DataFrame({'A':[1,2,np.nan],
                 'B':[5,np.nan,np.nan],
                 'C':[1,2,3]})

In [104]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [105]:
df.isna()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [106]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [107]:
'''
#Handling Missing values
#1) Remove the records/columns
#2)replace missing values
    #1.numerical values ==>mean/median
    #2.catogorical values ==> mode

#in which case we use median instead of mean for removing of missing values
==>When we have outliers in your data mean is affected by outliers, so don't use mean, use median

'''

"\n#Handling Missing values\n#1) Remove the records/columns\n#2)replace missing values\n    #1.numerical values ==>mean/median\n    #2.catogorical values ==> mode\n\n#in which case we use median instead of mean for removing of missing values\n==>When we have outliers in your data mean is affected by outliers, so don't use mean, use median\n\n"

In [108]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [111]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [112]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3